Revit 2017 API
FabricationUtils.ValidateConnectivity Method
 Check if two connectors are valid to connect directly without couplings
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public static bool ValidateConnectivity(
	Document pAdoc,
	Connector pConn1,
	Connector pConn2
)
Visual Basic
Public Shared Function ValidateConnectivity ( _
	pAdoc As Document, _
	pConn1 As Connector, _
	pConn2 As Connector _
) As Boolean
Visual C++
public:
static bool ValidateConnectivity(
	Document^ pAdoc,
	Connector^ pConn1,
	Connector^ pConn2
)
Parameters
pAdoc
Type: Autodesk.Revit.DB.Document
 The document.
pConn1
Type: Autodesk.Revit.DB.Connector
 First connector to check.
pConn2
Type: Autodesk.Revit.DB.Connector
 Second connector to check against.
Return Value
 True if connection is valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
FabricationUtils Class
Autodesk.Revit.DB.Fabrication Namespace